FreeRTOS/FreeRTOS/FreeRTOS/Demo/RL78_E2Studio_GCC/src/iodefine/iodefine_RL78L1C_ext.h
#define SEG23 (*(volatile unsigned char *)0xF0417)
#define SEG24 (*(volatile unsigned char *)0xF0418)
#define SEG25 (*(volatile unsigned char *)0xF0419)
#define SEG26 (*(volatile unsigned char *)0xF041A)
#define SEG27 (*(volatile unsigned char *)0xF041B)
#define SEG28 (*(volatile unsigned char *)0xF041C)
#define SEG29 (*(volatile unsigned char *)0xF041D)
#define SEG30 (*(volatile unsigned char *)0xF041E)
#define SEG31 (*(volatile unsigned char *)0xF041F)
#define SEG32 (*(volatile unsigned char *)0xF0420)
#define SEG33 (*(volatile unsigned char *)0xF0421)
#define SEG34 (*(volatile unsigned char *)0xF0422)
#define SEG35 (*(volatile unsigned char *)0xF0423)
#define SEG36 (*(volatile unsigned char *)0xF0424)
#define SEG37 (*(volatile unsigned char *)0xF0425)
#define SEG38 (*(volatile unsigned char *)0xF0426)
#define SEG39 (*(volatile unsigned char *)0xF0427)
#define SEG40 (*(volatile unsigned char *)0xF0428)
#define SEG41 (*(volatile unsigned char *)0xF0429)
#define SEG42 (*(volatile unsigned char *)0xF042A)
#define SEG43 (*(volatile unsigned char *)0xF042B)
#define SEG44 (*(volatile unsigned char *)0xF042C)
#define SEG45 (*(volatile unsigned char *)0xF042D)
#define SEG46 (*(volatile unsigned char *)0xF042E)
#define SEG47 (*(volatile unsigned char *)0xF042F)
#define SEG48 (*(volatile unsigned char *)0xF0430)
#define SEG49 (*(volatile unsigned char *)0xF0431)
#define SEG50 (*(volatile unsigned char *)0xF0432)
#define SEG51 (*(volatile unsigned char *)0xF0433)
#define SEG52 (*(volatile unsigned char *)0xF0434)
#define SEG53 (*(volatile unsigned char *)0xF0435)
#define SEG54 (*(volatile unsigned char *)0xF0436)
#define SEG55 (*(volatile unsigned char *)0xF0437)
#define TKBCR00 (*(volatile unsigned short *)0xF0500)
#define TKBCR01 (*(volatile unsigned short *)0xF0502)
#define TKBCR02 (*(volatile unsigned short *)0xF0504)
#define TKBCR03 (*(volatile unsigned short *)0xF0506)
#define TKBTGCR0 (*(volatile unsigned short *)0xF0508)
#define TKBSIR00 (*(volatile unsigned short *)0xF050A)
#define TKBSIR01 (*(volatile unsigned short *)0xF050C)
#define TKBDNR00 (*(volatile unsigned char *)0xF050E)
#define TKBSSR00 (*(volatile unsigned char *)0xF050F)
#define TKBDNR01 (*(volatile unsigned char *)0xF0510)
#define TKBSSR01 (*(volatile unsigned char *)0xF0511)
#define TKBTRG0 (*(volatile union un_tkbtrg0 *)0xF0512).tkbtrg0
#define TKBTRG0_bit (*(volatile union un_tkbtrg0 *)0xF0512).BIT
#define TKBFLG0 (*(volatile union un_tkbflg0 *)0xF0513).tkbflg0
#define TKBFLG0_bit (*(volatile union un_tkbflg0 *)0xF0513).BIT
#define TKBCRLD00 (*(volatile unsigned short *)0xF0514)
#define TKBCRLD01 (*(volatile unsigned short *)0xF0516)
#define TKBCNT0 (*(volatile unsigned short *)0xF0520)
#define TKBCTL00 (*(volatile unsigned short *)0xF0522)
#define TKBMFR0 (*(volatile unsigned short *)0xF0524)
#define TKBIOC00 (*(volatile union un_tkbioc00 *)0xF0526).tkbioc00
#define TKBIOC00_bit (*(volatile union un_tkbioc00 *)0xF0526).BIT
#define TKBCLR0 (*(volatile union un_tkbclr0 *)0xF0527).tkbclr0
#define TKBCLR0_bit (*(volatile union un_tkbclr0 *)0xF0527).BIT
#define TKBIOC01 (*(volatile union un_tkbioc01 *)0xF0528).tkbioc01
#define TKBIOC01_bit (*(volatile union un_tkbioc01 *)0xF0528).BIT
#define TKBCTL01 (*(volatile union un_tkbctl01 *)0xF0529).tkbctl01
#define TKBCTL01_bit (*(volatile union un_tkbctl01 *)0xF0529).BIT
#define TKBPSCS0 (*(volatile unsigned char *)0xF052A)
#define TKBPACTL00 (*(volatile unsigned short *)0xF0530)
#define TKBPACTL01 (*(volatile unsigned short *)0xF0532)
#define TKBPAHFS0 (*(volatile union un_tkbpahfs0 *)0xF0534).tkbpahfs0
#define TKBPAHFS0_bit (*(volatile union un_tkbpahfs0 *)0xF0534).BIT
#define TKBPAHFT0 (*(volatile union un_tkbpahft0 *)0xF0535).tkbpahft0
#define TKBPAHFT0_bit (*(volatile union un_tkbpahft0 *)0xF0535).BIT
#define TKBPAFLG0 (*(volatile union un_tkbpaflg0 *)0xF0536).tkbpaflg0
#define TKBPAFLG0_bit (*(volatile union un_tkbpaflg0 *)0xF0536).BIT
#define TKBPACTL02 (*(volatile union un_tkbpactl02 *)0xF0537).tkbpactl02
#define TKBPACTL02_bit (*(volatile union un_tkbpactl02 *)0xF0537).BIT
#define D0FIFOD00 (*(volatile unsigned short *)0xF0580)
#define D1FIFOD00 (*(volatile unsigned short *)0xF05C0)
#define SYSCFG (*(volatile unsigned short *)0xF0600)
#define SYSSTS0 (*(volatile unsigned short *)0xF0604)
#define DVSTCTR0 (*(volatile unsigned short *)0xF0608)
#define CFIFOM (*(volatile unsigned short *)0xF0614)
#define CFIFOML (*(volatile unsigned char *)0xF0614)
#define D0FIFOM (*(volatile unsigned short *)0xF0618)
#define D0FIFOML (*(volatile unsigned char *)0xF0618)
#define D1FIFOM (*(volatile unsigned short *)0xF061C)
#define D1FIFOML (*(volatile unsigned char *)0xF061C)
#define CFIFOSEL (*(volatile unsigned short *)0xF0620)
#define CFIFOCTR (*(volatile unsigned short *)0xF0622)
#define D0FIFOSEL (*(volatile unsigned short *)0xF0628)
#define D0FIFOCTR (*(volatile unsigned short *)0xF062A)
#define D1FIFOSEL (*(volatile unsigned short *)0xF062C)
#define D1FIFOCTR (*(volatile unsigned short *)0xF062E)
#define INTENB0 (*(volatile unsigned short *)0xF0630)
#define INTENB1 (*(volatile unsigned short *)0xF0632)
#define BRDYENB (*(volatile unsigned short *)0xF0636)
#define NRDYENB (*(volatile unsigned short *)0xF0638)
#define BEMPENB (*(volatile unsigned short *)0xF063A)
#define SOFCFG (*(volatile unsigned short *)0xF063C)
#define INTSTS0 (*(volatile unsigned short *)0xF0640)
#define INTSTS1 (*(volatile unsigned short *)0xF0642)
#define BRDYSTS (*(volatile unsigned short *)0xF0646)
#define NRDYSTS (*(volatile unsigned short *)0xF0648)
#define BEMPSTS (*(volatile unsigned short *)0xF064A)
#define FRMNUM (*(volatile unsigned short *)0xF064C)
#define USBADDR (*(volatile unsigned short *)0xF0650)
#define USBREQ (*(volatile unsigned short *)0xF0654)
#define USBVAL (*(volatile unsigned short *)0xF0656)
#define USBINDX (*(volatile unsigned short *)0xF0658)
#define USBLENG (*(volatile unsigned short *)0xF065A)
#define DCPCFG (*(volatile unsigned short *)0xF065C)
#define DCPMAXP (*(volatile unsigned short *)0xF065E)
#define DCPCTR (*(volatile unsigned short *)0xF0660)
#define PIPESEL (*(volatile unsigned short *)0xF0664)
#define PIPECFG (*(volatile unsigned short *)0xF0668)
#define PIPEMAXP (*(volatile unsigned short *)0xF066C)
#define PIPE4CTR (*(volatile unsigned short *)0xF0676)
#define PIPE5CTR (*(volatile unsigned short *)0xF0678)
#define PIPE6CTR (*(volatile unsigned short *)0xF067A)
#define PIPE7CTR (*(volatile unsigned short *)0xF067C)
#define PIPE4TRE (*(volatile unsigned short *)0xF069C)
#define PIPE4TRN (*(volatile unsigned short *)0xF069E)
#define PIPE5TRE (*(volatile unsigned short *)0xF06A0)
#define PIPE5TRN (*(volatile unsigned short *)0xF06A2)
#define DTC0PCFG (*(volatile unsigned short *)0xF06A8)
#define DTC1PCFG (*(volatile unsigned short *)0xF06AC)
#define USBBCCTRL0 (*(volatile unsigned short *)0xF06B0)
#define USBBCOPT0 (*(volatile unsigned short *)0xF06B8)
#define USBMC (*(volatile unsigned short *)0xF06CC)

